//----------------------------------------------------------------- 1
console.log("1.")
let n1 = [0,1,2,3,4,5,6,7,8,9,10];
// let arr = [];
// let y=0;
let num1 = n1.filter(function(x)
{   
//  if(x%2!=0)
//     {   arr[y]=x;
//         y++;
//     }
    return x%2!=0;
});
console.log(num1);
//----------------------------------------------------------------- 2
console.log("2.")
let array = [0,9,1,8,2,7,3,6,4,5];
array.sort(function(a, b) {
    return a-b;
  });
console.log(array);
//----------------------------------------------------------------- 3
console.log("3.")
let n2 = [0,1,2,3,4,5,6,7,8,9,10];
let num = [];
let j=0;
// console.log(n2);
for(let i=0;i<n2.length;i++)
{   if(n2[i]%2!=0)
    {   num[j]=n2[i];
        j++
    }
}
console.log(num);
//----------------------------------------------------------------- 4
console.log("4.")
const myMap = new Map();
myMap.set('Adam',28);
myMap.set('Sophie',22);
myMap.set('Aorum',13);
console.log(myMap.get("Adam"));
//----------------------------------------------------------------- 5
console.log("5.")
let arr2 = [0,9,1,8,2,7,3,6,4,5];
let t;
for(let q=0;q<arr2.length;q++)
{   for(let w=0;w<arr2.length;w++)
    {   if(arr2[w]<arr2[w+1])
        {   t = arr2[w];
            arr2[w] = arr2[w+1];
            arr2[w+1] = t;
        }
    }
}
console.log(arr2);

//-----------------------------------------------------------------

// 1. ให้เขียน function ที่รับ Array ของตัวเลข และคืนค่าออกมาเป็น Array ของตัวเลข โดยที่เรียงเลขคู่จากน้อยไปมากก่อน แล้วตามด้วยเลขคี่จากมากไปน้อย
// เช่น
// ------------------------------
// Input - [ 1,8,4,7,2,6,9,7 ]
// Output - [ 2,4,6,8,9,7,7,1]
// ------------------------------
// Input - [ 9,8,7,6,5,4,3,2,1 ]
// Output - [ 2,4,6,8,9,7,5,3,1 ]
// ------------------------------
// 2. ให้เขียน Function ที่รับ Array ของตัวเลข และคืนค่าออกมาเป็น มัธยฐาน
// เช่น
// ------------------------------
// Input - [ 1,2,3,4,5,6,7,8,9 ]
// Output - 5
// ------------------------------
// Input - [ 1,2,3,4,5,6,7,8 ]
// Output - 4.5
// ------------------------------
// Input - [ 3,4,1,2,5,6,7,8,9 ]
// Output - 5
// ------------------------------
// Input - [ 1,4,7,5,8,2,6,3 ]
// Output - 4.5
// ------------------------------
// 3. ให้เขียนฟังก์ชันที่รับ Array ของตัวเลข และคืนค่าออกมาเป็น Array ที่เรียงลำดับความถี่จากน้อยไปมาก ถ้าความถี่เท่ากันให้เรียงจากมากไปน้อย
// ------------------------------
// Input - [ 4,4,4,7,2,2,2,5,3,3 ]
// Output - [ 7,5,3,4,2 ]
// ------------------------------
// Input - [ 1,1,1,2,2,2,2,3,3,4,4,5,5 ]
// Output - [ 5,4,3,1,2 ]
// ------------------------------
// Input - [ 9,9,7,7,6,6,7,7,7,9,1,2,3 ]
// Output - [ 3,2,1,6,9,7 ]
// ------------------------------
// Input - [ 1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,3,3,3]
// Output - [ 3,2,1 ]

//----------------------------------------------------------------- โจทย์เสริม 1
console.log("6.")
let arr3 = [9,8,7,6,5,4,3,2,1];
let arr4 = arr3.filter(function(a) { return a%2==0; });
arr4.sort();
let arr5 = arr3.filter(function(b) { return b%2!=0; });
arr5.reverse(arr5.sort());
let d=0;
let arr6 = [arr4.length + arr5.length];
for(let c of arr4)
{   arr6[d] = c;
    d++;
}
for(let c of arr5)
{   arr6[d] = c;
    d++;
}
console.log(arr6);
//----------------------------------------------------------------- โจทย์เสริม 2
console.log("7.")
let arr7 = [3,4,1,2,5,6,7,8];
arr7.sort(function(a, b) {
    return a-b;
  });
(arr7.length%2==1) ? console.log(arr7[((arr7.length-1)/2)]) : console.log( (arr7[((arr7.length-2)/2)] + arr7[((arr7.length)/2)]) /2 );
//----------------------------------------------------------------- โจทย์เสริม 3